# Reindex Series

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
s1 = Series([1,2,3,4])
s1
s1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
s2 = Series([1,2,3,4],index=['A', 'B', 'C', 'D'])
s2

A    1
B    2
C    3
D    4
dtype: int64

In [7]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
s2

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
s1.reindex(index=['A', 'B', 'C', 'D'])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s1.reindex(index=[1, 2]) #reindex 是重新排序,但不是改变原先但序列号

1    2
2    3
dtype: int64

# Reindex Dataframe

In [15]:
a = np.random.rand(15).reshape(3,5)
df = DataFrame(a,index=[1,2,3],columns=['A', 'B', 'C', 'D', 'E'])

In [16]:
df

          A         B         C         D         E
1  0.396697  0.249074  0.022773  0.493617  0.551640
2  0.184962  0.633341  0.513459  0.565381  0.766934
3  0.304436  0.800884  0.345745  0.337464  0.625950

In [19]:
df.reindex(index=[1,3], columns=['A','C'])

          A         C
1  0.396697  0.022773
3  0.304436  0.345745

# NaN = not a number

In [20]:
np.nan

nan

In [21]:
type(np.nan)

float

In [22]:
a=1
b = np.nan

In [23]:
c = a+b

In [24]:
c

nan

# NaN in Series

In [25]:
s1 = Series([1,2,np.nan, np.nan], index=['A', 'B', 'C', 'D'])
s1

A    1.0
B    2.0
C    NaN
D    NaN
dtype: float64

In [26]:
s1.isnull()

A    False
B    False
C     True
D     True
dtype: bool

In [27]:
s1.notnull()

A     True
B     True
C    False
D    False
dtype: bool

In [28]:
s1.dropna()

A    1.0
B    2.0
dtype: float64

# NaN in DataFrame

In [39]:
df = DataFrame([[1,2,3],[4,np.nan,np.nan],[7,np.nan,9]])
df

   0    1    2
0  1  2.0  3.0
1  4  NaN  NaN
2  7  NaN  9.0

In [31]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False   True  False

In [32]:
df.notnull()

      0      1     2
0  True   True  True
1  True  False  True
2  True  False  True

In [34]:
df.dropna(how='all')

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [40]:
df.fillna(axis=0, value={1:1,2:2})

   0    1    2
0  1  2.0  3.0
1  4  1.0  2.0
2  7  1.0  9.0